FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗадачиПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиПланировщика</Name>
			<Comment>Задачи планировщика</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь для которго назначается задача</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Comment>Вид выполняемой задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗадачПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Имя формы или имя запускаемой процедуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодЗапускаЗадачи</Name>
					<Comment>Период запуска задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыЗапускаЗадачПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментЗапускаЗадачи</Name>
					<Comment>Момент запуска задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеПриОшибке</Name>
					<Comment>Действие при ошибке выполнения задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийПриОшибкеВыполненияЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодическая</Name>
					<Comment>Признак периодичности задачи пданировщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИВремяОднократногоЗапуска</Name>
					<Comment>Дата и время однократного запуска задачи планировщика</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалятьЗадачуПослеЗапуска</Name>
					<Comment>Признак удаления задачи планировщика после запуска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидЗадачПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидЗадачПланировщика</Name>
			<Comment>Вид задач планировщика</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеПоследовательности</Name>
					<Comment>Восстановление последовательности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеРаботыСистемы</Name>
					<Comment>Завершение работы системы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеФормы</Name>
					<Comment>Открытие формы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускПроцедуры</Name>
					<Comment>Запуск процедуры встроенного языка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗадачиПланировщика/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого НоваяЗапись Из ЭтотОбъект Цикл
		Если обЗначениеНеЗаполнено(НоваяЗапись.ВидЗадачи) Тогда
			Сообщить("Не указан вид задачи!",СтатусСообщения.Важное); Отказ=Истина;
		ИначеЕсли НоваяЗапись.ВидЗадачи<>Перечисления.ВидЗадачПланировщика.ЗавершениеРаботыСистемы И обЗначениеНеЗаполнено(НоваяЗапись.Объект) Тогда
			Сообщить("Не указан объект действия!",СтатусСообщения.Важное); Отказ=Истина;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(НоваяЗапись.ДействиеПриОшибке) Тогда
			Сообщить("Не указано действие при ошибке!",СтатусСообщения.Важное); Отказ=Истина;
		КонецЕсли;
		
		Если НоваяЗапись.Периодическая Тогда
			Если обЗначениеНеЗаполнено(НоваяЗапись.ПериодЗапускаЗадачи) Тогда
				Сообщить("Не указан период запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			ИначеЕсли НоваяЗапись.ПериодЗапускаЗадачи=Перечисления.ПериодыЗапускаЗадачПланировщика.Ежедневно И обЗначениеНеЗаполнено(НоваяЗапись.МоментЗапускаЗадачи) Тогда
				Сообщить("Не указан момент запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			КонецЕсли;
		Иначе
			Если обЗначениеНеЗаполнено(НоваяЗапись.ДатаИВремяОднократногоЗапуска) Тогда
				Сообщить("Не указаны дата и время запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
